# terraform apply -auto-approve
## Error: the server could not find the requested resource (post secrets) ："kubernetes_secret" "cert_manager_token"
```
[nix-shell:/home/creasy/githubs/homelab]# cd external/

[nix-shell:/home/creasy/githubs/homelab/external]# terraform apply -auto-approve
module.zerotier.zerotier_identity.router: Refreshing state... [id=8e8e989587]
module.cloudflare.data.http.public_ipv4: Reading...
module.cloudflare.random_password.tunnel_secret: Refreshing state... [id=none]
module.zerotier.zerotier_network.network: Refreshing state... [id=e5cd7a9e1cb84b70]
module.cloudflare.data.cloudflare_api_token_permission_groups.all: Reading...
module.cloudflare.cloudflare_argo_tunnel.homelab: Refreshing state... [id=054a86b2-301a-4ed6-b14c-25761e06e3c5]
module.cloudflare.data.cloudflare_zone.zone: Reading...
module.cloudflare.data.http.public_ipv4: Read complete after 0s [id=https://ipv4.icanhazip.com]
module.zerotier.zerotier_member.router: Refreshing state... [id=e5cd7a9e1cb84b70/8e8e989587]
module.cloudflare.data.cloudflare_api_token_permission_groups.all: Read complete after 1s [id=db26bb2fe42e291eab2965e0fbca358d]
module.cloudflare.cloudflare_api_token.cert_manager: Refreshing state... [id=fc32ba79767e8a3ecca3462b93f541fa]
module.cloudflare.cloudflare_api_token.external_dns: Refreshing state... [id=24a5d32ac68b4404f03a9a48abd9fcd0]
module.cloudflare.data.cloudflare_zone.zone: Read complete after 2s [id=6d7f06f2ea702dc16c872ad80ab91e37]
module.cloudflare.cloudflare_record.tunnel: Refreshing state... [id=97c6049f37c8564e4bf6988222e21c6a]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cloudflare.kubernetes_secret.cert_manager_token will be created
  + resource "kubernetes_secret" "cert_manager_token" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "cloudflare-api-token"
          + namespace        = "cert-manager"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.cloudflare.kubernetes_secret.cloudflared_credentials will be created
  + resource "kubernetes_secret" "cloudflared_credentials" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "cloudflared-credentials"
          + namespace        = "cloudflared"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.cloudflare.kubernetes_secret.external_dns_token will be created
  + resource "kubernetes_secret" "external_dns_token" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "cloudflare-api-token"
          + namespace        = "external-dns"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.zerotier.kubernetes_secret.router will be created
  + resource "kubernetes_secret" "router" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "zerotier-router"
          + namespace        = "zerotier"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
module.zerotier.kubernetes_secret.router: Creating...
module.cloudflare.kubernetes_secret.cloudflared_credentials: Creating...
module.cloudflare.kubernetes_secret.external_dns_token: Creating...
module.cloudflare.kubernetes_secret.cert_manager_token: Creating...
╷
│ Warning: Deprecated attribute
│ 
│   on modules/cloudflare/main.tf line 17, in locals:
│   17:     "${chomp(data.http.public_ipv4.body)}/32",
│ 
│ The attribute "body" is deprecated. Refer to the provider documentation for details.
│ 
│ (and one more similar warning elsewhere)
╵
╷
│ Error: the server could not find the requested resource (post secrets)
│ 
│   with module.cloudflare.kubernetes_secret.cloudflared_credentials,
│   on modules/cloudflare/main.tf line 43, in resource "kubernetes_secret" "cloudflared_credentials":
│   43: resource "kubernetes_secret" "cloudflared_credentials" {
│ 
╵
╷
│ Error: the server could not find the requested resource (post secrets)
│ 
│   with module.cloudflare.kubernetes_secret.external_dns_token,
│   on modules/cloudflare/main.tf line 79, in resource "kubernetes_secret" "external_dns_token":
│   79: resource "kubernetes_secret" "external_dns_token" {
│ 
╵
╷
│ Error: the server could not find the requested resource (post secrets)
│ 
│   with module.cloudflare.kubernetes_secret.cert_manager_token,
│   on modules/cloudflare/main.tf line 110, in resource "kubernetes_secret" "cert_manager_token":
│  110: resource "kubernetes_secret" "cert_manager_token" {
│ 
╵
╷
│ Error: the server could not find the requested resource (post secrets)
│ 
│   with module.zerotier.kubernetes_secret.router,
│   on modules/zerotier/main.tf line 42, in resource "kubernetes_secret" "router":
│   42: resource "kubernetes_secret" "router" {
│ 
╵
```